<template>
    <el-main>
        <div style="background: #010101">
        <h1 class="u-serve">服务协议</h1>
        </div>
        <div class="u-serve-box">
        <div class="u-serve-text">
            欢迎您使用中国气象局天气服务。请您在注册成为气象局用户前,仔细阅读、充分理解本《中国气象局天气服务协议》(下文简称“协议" )内容，您的注册、登录及使用服务等行为将被视为您已认可并接收本协议中的各条款内容。本协议对您及气象局均具有法律效力，一旦您选择同意”并完成注册,即表示您同意遵循本协议之所有约定。
            <br/>
            <h3 class="u-blue"> 一、服务介绍</h3>
            <br/>
            中国气象局天气致力于向气象局用户提供准确、稳定、丰富的天数据服务,该服务隶属于中国气象局,内容包括但不限定于天气数据API.气网页插件、微信查询天气服务及网站查询天气服务(具体参见tp://ww.qixiangju.com).本协议适用于中国气象局天所有产品及服务。本协议下文中，“中国气象局天气”亦指中国气象局。
            <br/>
            <h3 class="u-blue"> 二、您的权利与义务</h3>
            <br/>
            您在注册气象局天气服务时应当提供真实、台法、 有效的相关信息,并对所提供的信息承担相应的法律责任;您有义务妥善保管注册帐号信息及帐号密码，并就此帐号以及密码项下的一切活动负全部责任。如因您自身原因导致被他人获悉自己的帐号资料(包括但不限于帐号名称、密码、个人信息) ,从而导致的损失由用户本人承担;您在遵守法律及本协议的前提下可依本协议使用气象局天气服务。您无权变施包括但不限于下列行为:
            1.以任何方式对气象局天气的产品和服务进行干扰、仟扰、破坏、修改或施加其他影响:2以任何括政方式亚套共取气多局天有数据:
            3.在未获得气象局天气授权的情况下,缓存气象局天气数据
            4.在获得天气数据后,将相关数据出租、出借、复制、转载发表出版,擅自借助本服务发展与之有关的衍生产品、服务、插件或者向任何第三方分发、销售或再绶权;
            5.利用本服务发表、 传送.传播、储存违反国家法律、危害国家安全、祖国统一、 社会稳定、 公序良俗的内容,或任何不当的、侮辱诽谤的、淫秽的暴力的及任何违反国家法律法规政策的内容;
            6其他以任何不台法的方式为任何不合法的目的.或以任何与本协议不一致的方式使用本协议提供的所有服务。您若违反上述规定,气象局天气有权终止、完全或部分中止、限制对您的服务。
            您在使用本服务相关的产品或终端所获得的数据中,除天气数据以外的内容并不代表气象局天气的观点,气象局天气对此美无关内容不承担任何法律责任。
            <br/>
            <h3 class="u-blue"> 三、气象局天气的权利与义务</h3>
            <br/>
            气象局天气在遵守法律及本协议的前提下可依本协议提供相应的服务。具体包括:
            <br/>
            1.根据本协议及用户所选择的项目向用户提供优质的天服务;  务方式,并有义务将更改的具体内容通知您;
            3.根据不同用户类别订购的天气服务内容及使用权限，气象局天气有权在 服务中或经过服务投放各种广告和宣传信息。您在使用本服务过程中不得屏蔽此类广告信息
            4.气象局天气有权监控您相关天气服务的使用情况,确保您遵守本条款的相关约定,同时将上述获得的反馈数据用于改善气象局天气服务的质量，从而更好地为您服务;
            5. 若您违反本协议的相关规定,气象局天气有权终止对您提共相应的天气服务,并遍究您违约的相关法律责任。
            <br/>
            <h3 class="u-blue"> 四、隐私保护</h3>
            <br/>
            气象局天气收集您的用户信息,旨在完善相关的服务数据以及持续为您提供更好的服务。气象局天气通过以下两种途径收集您的用户信息:1.您向气象局天气提供的信息(注册时提供个人信息,包括电子邮件地址和其他信息) ;
            2.气象局天气在您使用天气服务的过程中获取的服务信息(包括访问量. IP地址和请求记录等).
            <br/>
            气象局天气充分尊重用户个人隐私信息,将会采取合理的措施保护用户的个人隐私信息,除法律或本协议要求或其他气象局天认为必要的情况之外,气象局天气不会向合作单位以外的第三方公开或透露用户的个人资料及保存在象局天各项服务中的非公开内容,其他情况具体包括但不限
            <br/>
            2.用于预防、直找或处理欺诈、2.用手核防、宣视或处理歌拌安全眼技术方面引起的同题。
            <br/>
            <h3 class="u-blue"> 五、免责声明</h3>
            <br/>
            1.著您违反本协议及其他相关服务条款的规定，气象局天 气有权立即终止服务，服务终止对您带来的-切直接损失与间接损失 ,气象局天气不承担任何的法律责任;
            2.因您违反本协议及其他相关服务条款的规定,造成其他任何第三方产生经济损失,由您负责赔偿,气象局天气及相关合作单位不承担任何的法律
            <br/>
            3.因不可抗力事件,包括但不限于自然灾害、社会环境变化(如罢工、战争、物资短缺、人员伤亡、政府政策管制等) .网络服务质量、通讯线路或设备故障、计算机病毒、黑客攻击等不可控因素造成的服务中断,用户需自行承担此类风险,气象局天气对此造成的损失不承担相应的责任。但气象局天 应积极与相关单位配合，及时处理修复，保证相关天服务正常提供，
            4.在任何情况下， 气象局天气不对因使用气象局天气API及播件服务所产生的直接、间接损失承担任何法律责任(直接、间接损失包括但不限于利5.若发生本协议其他条款所规定的情形(如涉及气象局天气的赔偿条款) , 气象局天气在承相应承相的全部责任的情况下,对您的赔偿数额始终不超过您在会员期内支付给气象局天气的费用。
            <br/>
            <h3 class="u-blue"> 六、知识产权保护</h3>
            <br/>
            气象局天气网站( ht:/:/www.qixiangju.com )展示的所有内容,均由气象局天气依法拥有其知识产权,内容包括但不限于:圖标、界面设计、色彩、文字描述、有关数据、代码等均受中华人民共和国著作权法、商标法、专利法、反不正当竞争法和相应的国际条约以及其他知识产权法律法规的保护。
            <br/>
            <h3 class="u-blue">七、服务条款变更</h3>
            <br/>

            中国气象局对本服务协议有最终的解释权及修订权,若协议中条款发生变动,气象局天气会在其网站页面的显著位置提示修改的内容.您若不接受服务条款的更改,可随时申请停止使用气象局天服务。如果您继续使用服务,则视为已接受本协议相关条款的变动。
            <br/>
            <h3 class="u-blue">  八.法律适用</h3>
            <br/>
            本协议之效力、解释、变更、执行与争议解决均受中华人民共和国法律的约束并依据其解释。因本协议产生的争议。纠纷,首先应友好协商解决;协向不成的,您和气象局天气一致同意将纠纷交由北京市海淀区人民法院管辖。

        </div>
        </div>



    </el-main>
</template>

<script>
    export default {
        name: "service"
    }
</script>

<style lang="less">
    .u-serve {
             color: #f3e6ea;
             margin: 0 auto;
             font-size:23px;
             width:150px;
             height:100px;
             text-align:center;
             line-height:100px;
             background: #010101;
         }
    .u-serve-box{
        width: 100%;
        background-color: #fbfbfb;
        .u-serve-text{
            background-color: #fff;
            padding: 40px 20px;
            margin: 0 100px;
            .u-blue{
                color: #0093fb;
            }
        }
    }

</style>